

#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include "windows.h";
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	 /*
	  OS/2 DB2 130 22 3343
	  Windows/NT SQLServer 230 24 2685
	  SCO/Unix Oracle 110 48 3745
	  */


	char name1[11], name2[11], name3[11], 
		 name4[11], name5[11], name6[11]; 
	int cnt1, cnt2, cnt3,
		cnt4, cnt5, cnt6,
		cnt7, cnt8, cnt9;
	
	/* Введение фактических данных*/
	printf("1. введите:  операционную систему,  субд,  мин.объем внешней памяти (mb),  мин.объем оперативной памяти (mb) >");
	scanf("%s %s %d %d %d", name1, name4, &cnt1, &cnt4, &cnt7);
	printf("2. введите: операционную систему,  субд,  мин.объем внешней памяти (mb),  мин.объем оперативной памяти (mb) >");
	scanf("%s %s %d %d %d", name2, name5, &cnt2, &cnt5, &cnt8);
	printf("3. введите: операционную систему,  субд,  мин.объем внешней памяти (mb),  мин.объем оперативной памяти (mb) >");
	scanf("%s %s %d %d %d", name3, name6, &cnt3, &cnt6, &cnt9);

	/* Вывод таблицы */
	/* вывод заголовков */
	printf("---------------------------------------------------------------------------------------------------------------------------------\n");
	printf("|Конфигурация програмных средств информационных систем                                                                          |\n");
	printf("|-------------------------------------------------------------------------------------------------------------------------------|\n");
	printf("| Операционная система |  С У Б Д  | Мин.объем внешней памяти (MB)| Мин.объем оперативной памяти (MB)| Приблизительная цена ($) |\n");
	printf("|----------------------|-----------|------------------------------|----------------------------------|--------------------------|\n");
	/* вывод строк фактических данных */
	printf("| %20s | %9s | %28d | %32d | %24d |\n", name1, name4, cnt1, cnt4, cnt7);
	printf("| %20s | %9s | %28d | %32d | %24d |\n", name2, name5, cnt2, cnt5, cnt8);
	printf("| %20s | %9s | %28d | %32d | %24d |\n", name3, name6, cnt3, cnt6, cnt9);
	/* вывод примечаний */
	printf("|-------------------------------------------------------------------------------------------------------------------------------|\n");
	printf("| Примечание: принималась цена лицензии на 8 пользователей                                                                      |\n");
	printf("---------------------------------------------------------------------------------------------------------------------------------\n");
	return 0;
}
