// lab5(b).cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>
#include <conio.h>
using namespace std;

int main() {
    setlocale(LC_ALL, "RUS");
   

    int g;
    while (1) {
        system("cls");
        printf("\t***Склонение слова гриб в зависимости от числа***\n");
        printf("Введите количество грибов ");
        scanf("%d", &g);

        if ((g >= 11) &&  (g <= 19))
            printf("У меня %d грибов", g);

        else 
            if ((g % 10 >= 2) && (g % 10 <= 4))
                printf("У меня %d гриба", g);

        else 
            if (g % 10 == 1)
                printf("У меня %d гриб", g);

        else 
            if ((g % 10 >= 5) && (g % 10 <= 9) || (g % 10 == 0))
                printf("У меня %d грибов", g);

        else
            printf("Ошибка, введите положительное число!");




        printf("\n\n\n\n\n");
        printf("Введите любую клавишу для продолжения");
        _getch();
    }

    return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
